{
  "architectures": [
    "EsmForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "emb_layer_norm_before": null,
  "esmfold_config": null,
  "hidden_dropout_prob": 0.1,
  "hidden_size": 16,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_folding_model": false,
  "layer_norm_eps": 1e-12,
  "mask_token_id": null,
  "max_position_embeddings": 1026,
  "model_type": "esm",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "position_embedding_type": "absolute",
  "token_dropout": false,
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "use_cache": true,
  "vocab_list": null,
  "vocab_size": 32
}
