{
  "activation": "swiglu",
  "alternate_sparsity": true,
  "architectures": [
    "BalmMoEForMaskedLM"
  ],
  "attention_classifier": false,
  "attention_dropout": 0.1,
  "classifier_activation": "tanh",
  "classifier_attention_heads": 4,
  "classifier_freeze_base": true,
  "dropout": 0.1,
  "expert_activation": "swiglu",
  "expert_bias": true,
  "expert_capacity": 1,
  "expert_capacity_type": "multiplier",
  "expert_dropout": 0.1,
  "expert_intermediate_size": [
    64,
    64
  ],
  "ffn_bias": true,
  "hidden_dropout": 0.1,
  "hidden_size": 16,
  "homogeneous_experts": true,
  "initializer_range": 0.02,
  "intermediate_size": 64,
  "layer_norm_eps": 1e-05,
  "mask_token_id": 31,
  "max_position_embeddings": 256,
  "mlm_activation": "gelu",
  "model_type": "balm_moe",
  "num_attention_heads": 4,
  "num_experts": 2,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 2,
  "num_initial_dense_layers": 1,
  "num_shared_experts": 0,
  "output_classifier_attentions": false,
  "output_expert_indexes": false,
  "output_router_logits": false,
  "pad_token_id": 1,
  "position_embedding_type": "rotary",
  "router_aux_loss_coef": 0.01,
  "router_bias": false,
  "router_dtype": "float32",
  "router_jitter": 0.0,
  "router_mask_aux_loss": false,
  "router_penalty_loss_coef": 0.1,
  "router_type": "top-k",
  "router_use_penalty_loss": false,
  "router_z_loss_coef": 0.001,
  "shared_expert_intermediate_size": 64,
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "use_cache": true,
  "vocab_size": 32
}
