{
  "activation": "swiglu",
  "architectures": [
    "BalmForMaskedLM"
  ],
  "attention_classifier": false,
  "attention_dropout": 0.1,
  "classifier_activation": "tanh",
  "classifier_attention_heads": 4,
  "classifier_freeze_base": true,
  "dropout": 0.1,
  "ffn_bias": true,
  "hidden_dropout": 0.1,
  "hidden_size": 16,
  "initializer_range": 0.02,
  "intermediate_size": 64,
  "layer_norm_eps": 1e-05,
  "mask_token_id": 31,
  "max_position_embeddings": 256,
  "mlm_activation": "gelu",
  "model_type": "balm",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "output_classifier_attentions": false,
  "pad_token_id": 1,
  "position_embedding_type": "rotary",
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "use_cache": true,
  "vocab_size": 32
}
